Update DeveloperLandingZonePattern.md
